# Appendix : Pandas for Data Analysis

In [4]:
# Importing pandas

import pandas as pd

## 1. Datatypes

pandas has two main datatypes, `Series` and `Dataframe`.

- `Series` - a 1-dimensional column of data.
- `Dataframe` (most common) - a 2-dimensional of data with rows and columns.

In [7]:
# Creating a series of car types
series = pd.Series(["BMW","Toyota","Honda"])
series

0       BMW
1    Toyota
2     Honda
dtype: object

In [8]:
colours = pd.Series(["red","blue","black","white"])
colours

0      red
1     blue
2    black
3    white
dtype: object

In [9]:
# Creating a DataFrame = 2-dimensional

car_data = pd.DataFrame({"Car make": series, "Colour": colours})
car_data

  Car make Colour
0      BMW    red
1   Toyota   blue
2    Honda  black
3      NaN  white

You can see the keys of the dictionary became the column headings and the values of the two series's became the values in the DataFrame. It's important to note, many different types of data could go into the DataFrame.

**Exercices**

1. Make a `Series` of different foods.
2. Make a `Series` of different dollar values.
3.Combine your `Series`'s of foods and dollar value into a `DataFrame`.

In [10]:
# Exercices 

foods = pd.Series(["orange","apple","honey","strawberry"])
dollar = pd.Series([1.2,2.32,3,4.21])

food_data = pd.DataFrame({"foods Name": foods, "Price": dollar})
food_data

   foods Name  Price
0      orange   1.20
1       apple   2.32
2       honey   3.00
3  strawberry   4.21

## 2. Importing Data

In [12]:
# import data

car_sales = pd.read_csv("../data/car-sales.csv")
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

## 3. Exporting a dataframe

After you've made a few changes to your data, you might want to export it and save it so someone else can access the changes.

Pandas allows you to export `DataFrame` to `.csv` format using `.to_csv()` or spreadsheet format using `.to_excel()`.

In [13]:
# export dataframe

car_sales.to_csv("../data/exported-test.csv")

In [14]:
export_car_sales = pd.read_csv("../data/exported-test.csv")
export_car_sales

   Unnamed: 0    Make Colour  Odometer (KM)  Doors       Price
0           0  Toyota  White         150043      4   $4,000.00
1           1   Honda    Red          87899      4   $5,000.00
2           2  Toyota   Blue          32549      3   $7,000.00
3           3     BMW  Black          11179      5  $22,000.00
4           4  Nissan  White         213095      4   $3,500.00
5           5  Toyota  Green          99213      4   $4,500.00
6           6   Honda   Blue          45698      4   $7,500.00
7           7   Honda   Blue          54738      4   $7,000.00
8           8  Toyota  White          60000      4   $6,250.00
9           9  Nissan  White          31600      4   $9,700.00

As you can see the index of the dataframe were passed in the csv file. If you don't want the index to be a column of your csv file you have to add `index=False`.

In [15]:
car_sales.to_csv("../data/exported-test2.csv", index=False)

In [16]:
export_car_sales = pd.read_csv("../data/exported-test2.csv")
export_car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

**Exercises**
1. Practice importing a .csv file using pd.read_csv(), you can download heart-disease.csv. This file contains annonymous patient medical records and whether or not they have heart disease.
2. Practice exporting a DataFrame using .to_csv(). You could export the heart disease DataFrame after you've imported it.

In [17]:
# Exercises

df_heart = pd.read_csv("../data/heart-disease.csv")
df_heart

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
298,57,0,0,140,241,0,1,123,1,0.2,1,0,3,0
299,45,1,3,110,264,0,1,132,0,1.2,1,0,3,0
300,68,1,0,144,193,1,1,141,0,3.4,1,2,3,0
301,57,1,0,130,131,0,1,115,1,1.2,1,1,3,0
302,57,0,1,130,236,0,0,174,0,0.0,1,1,2,0

## 4. Describing Data

One of the first thing you'll want to do after you import some data into a pandas `DataFrame` is to start exploring it. Pandas has many built in functions which allows you to quickly get information about a `DataFrame`.

In [19]:
# car_sales dataframe

car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [21]:
# dtypes : data types

car_sales.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [24]:
# columns : name of the columns of the dataframe

car_sales.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [36]:
car_columns = car_sales.columns

for col in car_columns:
    print(col)

Make
Colour
Odometer (KM)
Doors
Price

In [27]:
# index : index of the dataframe (rows)

car_sales.index

RangeIndex(start=0, stop=10, step=1)

In [28]:
# describe

car_sales.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

`.describe()` gives you a quick statistical overview of the numerical columns.

In [29]:
# info

car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

`.info()` shows a handful of useful information about a `DataFrame` such as :
- How many entries (rows) there are
- Whether there are missing values
- The datatypes of each column

In [30]:
# mean

car_sales.mean()

Odometer (KM)    78601.4
Doors                4.0
dtype: float64

In [33]:
# mean on series

car_Doors = car_sales["Doors"]
car_Doors.mean()

4.0

In [35]:
# sum

car_Doors.sum()

40

In [38]:
# length of the DataFrame : number of rows

len(car_sales)

10

## 5. Viewing and Selecting Data

- `head()`
- `tail()`
- `loc`
- `iloc`
- `columns` - `df['A']`
- boolean indexing - `df[df['A']>5]`
- `crosstab()`
- `.plot()`
- `hist()`

In [43]:
# head : return the top 5 rows of the DataFrame

car_sales.head()

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [44]:
car_sales.head(7)

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00

In [45]:
# tail: the bottom 5 rows of the DataFrame

car_sales.tail()

     Make Colour  Odometer (KM)  Doors      Price
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [46]:
car_sales.tail(3)

     Make Colour  Odometer (KM)  Doors      Price
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [51]:
# .loc & .iloc

animals = pd.Series(["cat","dog","snake","panda","bird"],index=[0,3,9,8,3])
animals

0      cat
3      dog
9    snake
8    panda
3     bird
dtype: object

`.loc[]` takes an integer as input. And it chooses from your `Series` or `DataFrame` whichever index matches the number

In [52]:
# select all indexes with 3

animals.loc[3]

3     dog
3    bird
dtype: object

In [53]:
# select index 9
animals.loc[9]

'snake'

In [54]:
# example with car_sales
car_sales.loc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

`.iloc[]` does a similar thing but works with exact positions.

In [55]:
animals

0      cat
3      dog
9    snake
8    panda
3     bird
dtype: object

In [56]:
animals.iloc[3]

'panda'

panda appears at index 8 in the series, but it's at the 3rd position in the series (starting from 0).

In [57]:
# iloc with car sales

print(car_sales)
print(car_sales.iloc[4])

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00
Make                Nissan
Colour               White
Odometer (KM)       213095
Doors                    4
Price            $3,500.00
Name: 4, dtype: object

In [58]:
# slicing

animals.iloc[:3]

0      cat
3      dog
9    snake
dtype: object

In [62]:
# get all rows up to position

car_sales.iloc[:3]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
1   Honda    Red          87899      4  $5,000.00
2  Toyota   Blue          32549      3  $7,000.00

In [63]:
# get all rows up to index 3 (including 3)

car_sales.loc[:3]

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00

When should you use `.loc[]` or `.iloc[]`?

- Use  when you're referring to indexes.
- Use `.iloc[]` when you're referring to positions in the DataFrame (index is out of order).

In [65]:
# Select a Column

car_sales["Doors"]

0    4
1    4
2    3
3    5
4    4
5    4
6    4
7    4
8    4
9    4
Name: Doors, dtype: int64

In [68]:
# Select a column : other way

car_sales.Doors

0    4
1    4
2    3
3    5
4    4
5    4
6    4
7    4
8    4
9    4
Name: Doors, dtype: int64

In [71]:
# filter value : select all the cars with over 3 doors

car_sales[car_sales["Doors"] > 3 ]

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [72]:
# select cars which are made by toyota

car_sales[car_sales["Make"] == "Toyota"]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
2  Toyota   Blue          32549      3  $7,000.00
5  Toyota  Green          99213      4  $4,500.00
8  Toyota  White          60000      4  $6,250.00

`pd.crosstab()` is a great way to view two different columns together and compare them.